# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Uddannelse\Uni\Projekter\P4 - Digital semester\DigitalSemester\I2C_test.cydsn\I2C_test.cyprj
# Date: Tue, 24 May 2022 22:07:27 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1001 2001} -nominal_period 333333.33333333331 [list [get_pins {ClockBlock/dclk_glb_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Uddannelse\Uni\Projekter\P4 - Digital semester\DigitalSemester\I2C_test.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Uddannelse\Uni\Projekter\P4 - Digital semester\DigitalSemester\I2C_test.cydsn\I2C_test.cyprj
# Date: Tue, 24 May 2022 22:07:24 GMT
